{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "¡": 99,
      "¢": 100,
      "£": 101,
      "¤": 102,
      "¥": 103,
      "¦": 104,
      "§": 105,
      "¨": 106,
      "©": 107,
      "ª": 108,
      "«": 109,
      "¬": 110,
      "®": 111,
      "¯": 112,
      "°": 113,
      "±": 114,
      "²": 115,
      "³": 116,
      "´": 117,
      "µ": 118,
      "¶": 119,
      "·": 120,
      "¸": 121,
      "¹": 122,
      "º": 123,
      "»": 124,
      "¼": 125,
      "½": 126,
      "¾": 127,
      "¿": 128,
      "Â": 129,
      "Ã": 130,
      "Ä": 131,
      "Å": 132,
      "Æ": 133,
      "Ç": 134,
      "È": 135,
      "É": 136,
      "Ê": 137,
      "Ë": 138,
      "Ì": 139,
      "Í": 140,
      "Î": 141,
      "Ï": 142,
      "Ð": 143,
      "Ñ": 144,
      "Ò": 145,
      "Ó": 146,
      "Ô": 147,
      "Õ": 148,
      "Ö": 149,
      "×": 150,
      "Ø": 151,
      "Ù": 152,
      "Ú": 153,
      "Û": 154,
      "Ü": 155,
      "Ý": 156,
      "ß": 157,
      "à": 158,
      "á": 159,
      "â": 160,
      "ã": 161,
      "ä": 162,
      "å": 163,
      "æ": 164,
      "ç": 165,
      "è": 166,
      "é": 167,
      "ê": 168,
      "ë": 169,
      "ì": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ô": 174,
      "Ā": 175,
      "ā": 176,
      "Ă": 177,
      "ă": 178,
      "Ą": 179,
      "ą": 180,
      "Ć": 181,
      "ć": 182,
      "Ĉ": 183,
      "ĉ": 184,
      "Ċ": 185,
      "ċ": 186,
      "Č": 187,
      "Ď": 188,
      "ď": 189,
      "Đ": 190,
      "đ": 191,
      "Ē": 192,
      "ē": 193,
      "Ĕ": 194,
      "ĕ": 195,
      "Ė": 196,
      "ė": 197,
      "Ę": 198,
      "ę": 199,
      "Ě": 200,
      "ě": 201,
      "Ĝ": 202,
      "ĝ": 203,
      "Ğ": 204,
      "ğ": 205,
      "Ġ": 206,
      "ġ": 207,
      "Ģ": 208,
      "ģ": 209,
      "Ĥ": 210,
      "ĥ": 211,
      "Ħ": 212,
      "ħ": 213,
      "Ĩ": 214,
      "ĩ": 215,
      "Ī": 216,
      "ī": 217,
      "Ĭ": 218,
      "ĭ": 219,
      "Į": 220,
      "į": 221,
      "İ": 222,
      "ı": 223,
      "Ĳ": 224,
      "ĳ": 225,
      "Ĵ": 226,
      "ĵ": 227,
      "Ķ": 228,
      "ķ": 229,
      "ĸ": 230,
      "Ĺ": 231,
      "ĺ": 232,
      "Ļ": 233,
      "ļ": 234,
      "Ľ": 235,
      "ľ": 236,
      "Ŀ": 237,
      "ŀ": 238,
      "Ł": 239,
      "ł": 240,
      "Ń": 241,
      "Ġt": 242,
      "Ġa": 243,
      "he": 244,
      "in": 245,
      "on": 246,
      "re": 247,
      "Ġthe": 248,
      "ti": 249,
      "Ġs": 250,
      "Ġâ": 251,
      "Ġo": 252,
      "er": 253,
      "Ġc": 254,
      "Ġ(": 255,
      "is": 256,
      "ĠĊ": 257,
      "or": 258,
      "en": 259,
      "Ġf": 260,
      "Ġp": 261,
      "Ġw": 262,
      "at": 263,
      "nd": 264,
      "Ġof": 265,
      "es": 266,
      "tion": 267,
      "al": 268,
      "it": 269,
      "Ġb": 270,
      "ro": 271,
      "Ġin": 272,
      "ed": 273,
      "ĠâĪ": 274,
      "Ġd": 275,
      "Ġand": 276,
      "ing": 277,
      "an": 278,
      "ar": 279,
      "Ġn": 280,
      "Ġm": 281,
      "le": 282,
      "Ġ1": 283,
      "Ġis": 284,
      "Ġe": 285,
      "Ġth": 286,
      "ĠT": 287,
      "Ġ=": 288,
      "ĠÎ": 289,
      "Ġ.": 290,
      "ic": 291,
      "Ġto": 292,
      "Ġ,": 293,
      "Ġ2": 294,
      "Ġ)": 295,
      "et": 296,
      "om": 297,
      "ĠS": 298,
      "as": 299,
      "Ġre": 300,
      "ĠA": 301,
      "ation": 302,
      "ec": 303,
      "Ġthat": 304,
      "Ġfor": 305,
      "Ġg": 306,
      "âĪ": 307,
      "Ġi": 308,
      "ly": 309,
      "Ġh": 310,
      "Ġl": 311,
      "st": 312,
      "ent": 313,
      "ac": 314,
      "ve": 315,
      "ĠP": 316,
      "ll": 317,
      "ĠC": 318,
      "ĠI": 319,
      "Ġu": 320,
      "Ġv": 321,
      "Ġcon": 322,
      "ĠâĪĴ": 323,
      "Ġpro": 324,
      "ith": 325,
      "Ġwe": 326,
      "ce": 327,
      "ow": 328,
      "ĠThe": 329,
      "Ġ[": 330,
      "si": 331,
      "Ġ0": 332,
      "ĠL": 333,
      "im": 334,
      "ra": 335,
      "ĠF": 336,
      "Ġon": 337,
      "ou": 338,
      "ot": 339,
      "âĢ": 340,
      "ĠM": 341,
      "ĠÏ": 342,
      "Ġsu": 343,
      "Ġbe": 344,
      "Ġk": 345,
      "Ġ+": 346,
      "ut": 347,
      "se": 348,
      "Ġan": 349,
      "Ġas": 350,
      "ĠG": 351,
      "qu": 352,
      "od": 353,
      "ul": 354,
      "ĠB": 355,
      "ĠR": 356,
      "Ġwith": 357,
      "Ġâī": 358,
      "ri": 359,
      "ver": 360,
      "ĠW": 361,
      "ol": 362,
      "âĪĴ": 363,
      "am": 364,
      "ĠâĪĪ": 365,
      "Ġex": 366,
      "ab": 367,
      "Ġst": 368,
      "Ġby": 369,
      "ĠN": 370,
      "ĠE": 371,
      "um": 372,
      "ĠH": 373,
      "em": 374,
      "ore": 375,
      "ĠD": 376,
      "ĠÂ": 377,
      "omp": 378,
      "ch": 379,
      "Ġ|": 380,
      "ur": 381,
      "pp": 382,
      "ig": 383,
      "Ġx": 384,
      "Ġ3": 385,
      "ĠX": 386,
      "Ġare": 387,
      "Ġal": 388,
      "il": 389,
      "res": 390,
      "ity": 391,
      "ĠâĢ": 392,
      "tic": 393,
      "Ġr": 394,
      "el": 395,
      ").": 396,
      "ts": 397,
      "Ġde": 398,
      "ĠIn": 399,
      "),": 400,
      "ter": 401,
      "Ĺı": 402,
      "uc": 403,
      "ate": 404,
      "Ġit": 405,
      "ge": 406,
      "ĠO": 407,
      "Ġâī¤": 408,
      "Ġcomp": 409,
      "ain": 410,
      "un": 411,
      "Ġ4": 412,
      "og": 413,
      "rou": 414,
      "Ġwhe": 415,
      "Ġwh": 416,
      "ir": 417,
      "Ġcan": 418,
      "00": 419,
      "iv": 420,
      "Ġthis": 421,
      "id": 422,
      "lem": 423,
      "ĠWe": 424,
      "pl": 425,
      "ist": 426,
      "Ġ:": 427,
      "if": 428,
      "te": 429,
      "iz": 430,
      "rom": 431,
      "per": 432,
      "her": 433,
      "tive": 434,
      "ect": 435,
      "Ġha": 436,
      "orm": 437,
      "fin": 438,
      "ĠâĹı": 439,
      "ĠÂ·": 440,
      "ess": 441,
      "ma": 442,
      "Ġpo": 443,
      "Ġma": 444,
      "ure": 445,
      "Ġall": 446,
      "ĠV": 447,
      "ĠK": 448,
      "ich": 449,
      "Ġor": 450,
      "oll": 451,
      "ction": 452,
      "ph": 453,
      "Ġfrom": 454,
      "ach": 455,
      "us": 456,
      "Ġle": 457,
      "Ġj": 458,
      "Ġ{": 459,
      "Ġus": 460,
      "roup": 461,
      "Ġif": 462,
      "Ġnot": 463,
      "Ġï": 464,
      "Ġ6": 465,
      "ĨĴ": 466,
      "Ġset": 467,
      "ari": 468,
      "Ġat": 469,
      "ĠPro": 470,
      "ĠJ": 471,
      "Ġse": 472,
      "oc": 473,
      "Ġwhich": 474,
      "Ġres": 475,
      "sion": 476,
      "ĠU": 477,
      "de": 478,
      "Ġy": 479,
      "Ġpar": 480,
      "Ġhave": 481,
      "Ġ5": 482,
      "01": 483,
      "tim": 484,
      "Ġsub": 485,
      "end": 486,
      "Ġapp": 487,
      "Ġsh": 488,
      "âĢ²": 489,
      "ition": 490,
      "ations": 491,
      "der": 492,
      "ollow": 493,
      "gor": 494,
      "ence": 495,
      "ĠTh": 496,
      "ally": 497,
      "Ġfollow": 498,
      "Ġwhere": 499,
      "ren": 500,
      "ithm": 501,
      "of": 502,
      "Ġsp": 503,
      "Ġch": 504,
      "Ġprob": 505,
      "all": 506,
      "os": 507,
      "Ġcl": 508,
      "ĠâĬ": 509,
      "ad": 510,
      "able": 511,
      "gorithm": 512,
      "ĠZ": 513,
      "ound": 514,
      "Ġun": 515,
      "ase": 516,
      "Ġsuch": 517,
      "ated": 518,
      "Ġï£": 519,
      "tain": 520,
      "act": 521,
      "ĠÎ±": 522,
      "ener": 523,
      "ution": 524,
      "mp": 525,
      "Ġthen": 526,
      "ran": 527,
      "th": 528,
      "Ġq": 529,
      "str": 530,
      "âĢĵ": 531,
      "Ġne": 532,
      "ents": 533,
      "ple": 534,
      "duc": 535,
      "ĠY": 536,
      "orem": 537,
      "ant": 538,
      "Ġob": 539,
      "form": 540,
      "Ġver": 541,
      "ay": 542,
      "unction": 543,
      "yp": 544,
      "ber": 545,
      "Ġdefin": 546,
      "ite": 547,
      "ine": 548,
      "ĠLet": 549,
      "raph": 550,
      "ary": 551,
      "ection": 552,
      ".,": 553,
      "ies": 554,
      "âĪĹ": 555,
      "ther": 556,
      "erm": 557,
      "Ġgroup": 558,
      "Ġmod": 559,
      "Ġâī¥": 560,
      "Ġfunction": 561,
      "ĠâĨĴ": 562,
      "ĠFor": 563,
      "ct": 564,
      "Ġeach": 565,
      "Ġlog": 566,
      "Ġalgorithm": 567,
      "alu": 568,
      "Ġdist": 569,
      "fe": 570,
      "ree": 571,
      "Ġthere": 572,
      "igh": 573,
      "rib": 574,
      "ram": 575,
      "ĠÏĥ": 576,
      "red": 577,
      "ges": 578,
      "ance": 579,
      "Ġgener": 580,
      "Ġhas": 581,
      "Ġar": 582,
      "Î±": 583,
      "Ġco": 584,
      "ati": 585,
      "ork": 586,
      "ÌĤ": 587,
      "Ġ>": 588,
      "ome": 589,
      "Ġany": 590,
      "ĠâĢ²": 591,
      "ond": 592,
      "Ġbound": 593,
      "ff": 594,
      "feren": 595,
      "Ġab": 596,
      "ĠQ": 597,
      "Ġone": 598,
      "ĠLem": 599,
      "ĠÎ»": 600,
      "Ġsy": 601,
      "ose": 602,
      "Ġad": 603,
      "Ġfin": 604,
      "Ġtw": 605,
      "Ġshow": 606,
      "and": 607,
      "Ġqu": 608,
      "Ġexp": 609,
      "est": 610,
      "Ġsim": 611,
      "int": 612,
      "Ġ7": 613,
      "ĠLemma": 614,
      "sum": 615,
      "ime": 616,
      "Ġresul": 617,
      "abil": 618,
      "Ġz": 619,
      "so": 620,
      "ĠTheorem": 621,
      "Ġ]": 622,
      "ers": 623,
      "Ġsam": 624,
      "ill": 625,
      "Ġpa": 626,
      "Ġnum": 627,
      "ĠThis": 628,
      "Ġmat": 629,
      "xim": 630,
      "Ġtwo": 631,
      "Ġgraph": 632,
      "Ġvari": 633,
      "sition": 634,
      "etw": 635,
      "Ġ<": 636,
      "Ġ201": 637,
      "Ġno": 638,
      "ince": 639,
      "ĠâĢľ": 640,
      "Ġ}": 641,
      "ric": 642,
      "ĠÎ²": 643,
      "ds": 644,
      "to": 645,
      "))": 646,
      "âĪĪ": 647,
      "].": 648,
      "Ġnumber": 649,
      "Ìĥ": 650,
      "âĢĻ": 651,
      "vi": 652,
      "Ġproblem": 653,
      "ous": 654,
      "ors": 655,
      "Ġgiv": 656,
      "ap": 657,
      "Ġsome": 658,
      "Î¸": 659,
      "gram": 660,
      "rans": 661,
      "ak": 662,
      "gh": 663,
      "Ġequ": 664,
      "Ġonly": 665,
      "cl": 666,
      "irst": 667,
      "Ġcase": 668,
      "Ġden": 669,
      "Ġtime": 670,
      "cess": 671,
      "],": 672,
      "ace": 673,
      "Ġra": 674,
      "Ġtyp": 675,
      "..": 676,
      "ort": 677,
      "Ġstr": 678,
      "ĠÂµ": 679,
      "atis": 680,
      "ble": 681,
      "dition": 682,
      "ĠÎĵ": 683,
      "Ġnon": 684,
      "ard": 685,
      "ĠÎ¸": 686,
      "ĠâĪĹ": 687,
      "ability": 688,
      "age": 689,
      "10": 690,
      "ĠÃ": 691,
      "ode": 692,
      "op": 693,
      "Ġmodel": 694,
      "ang": 695,
      "Ġcont": 696,
      "ust": 697,
      "ote": 698,
      "Ġform": 699,
      "ular": 700,
      "ĠÎ´": 701,
      "Ġour": 702,
      "Ġfollowing": 703,
      "Ġalso": 704,
      "ass": 705,
      "ix": 706,
      "Ġwill": 707,
      "Ġed": 708,
      "resent": 709,
      "Ġme": 710,
      "ast": 711,
      "Ġen": 712,
      "ĠÎ³": 713,
      "Ġcor": 714,
      "Ġop": 715,
      "Ġinter": 716,
      "Ġvalu": 717,
      "Ġ8": 718,
      "Ġappro": 719,
      "Ġ-": 720,
      "Ġcom": 721,
      "Ġimp": 722,
      "ting": 723,
      "Ġes": 724,
      "ĠThen": 725,
      "ates": 726,
      "ath": 727,
      "Ġmin": 728,
      "ost": 729,
      "Ġac": 730,
      "Ġdo": 731,
      "ign": 732,
      "Ġconst": 733,
      "very": 734,
      "ical": 735,
      "âĢĿ": 736,
      "ire": 737,
      "ĠIf": 738,
      "11": 739,
      "uct": 740,
      "Ġ10": 741,
      "Ġdes": 742,
      "Ġover": 743,
      "ata": 744,
      "Ġ/": 745,
      "Ġpre": 746,
      "ud": 747,
      "osition": 748,
      "Ġ),": 749,
      "ĠAs": 750,
      "Ġsc": 751,
      "Ġcomput": 752,
      "pend": 753,
      "ĠÏģ": 754,
      "lement": 755,
      "Ħĵ": 756,
      "Ġdistrib": 757,
      "Ġrep": 758,
      "Ġrel": 759,
      "ĠÏĦ": 760,
      "ong": 761,
      "our": 762,
      "Ġestim": 763,
      "ise": 764,
      "enti": 765,
      "Ġother": 766,
      "Ġassum": 767,
      "ial": 768,
      "ĠCon": 769,
      "Ġhe": 770,
      "Ġfirst": 771,
      "Ġdif": 772,
      "Ġwhen": 773,
      "ÌĦ": 774,
      "sider": 775,
      "Ġgiven": 776,
      "Î»": 777,
      "ser": 778,
      "Ġfollows": 779,
      "ty": 780,
      "Ġ).": 781,
      "ĠÏĢ": 782,
      "Ġsol": 783,
      "Ġmet": 784,
      "Ġper": 785,
      "ative": 786,
      "Ġso": 787,
      "ue": 788,
      "ep": 789,
      "ðĿ": 790,
      "sis": 791,
      "12": 792,
      "Ġcomple": 793,
      "Ġev": 794,
      "ication": 795,
      "stem": 796,
      "Ġuse": 797,
      "ality": 798,
      "Ġits": 799,
      "ie": 800,
      "Ġdis": 801,
      "ĠFig": 802,
      "ack": 803,
      "Ġtrans": 804,
      "âĹı": 805,
      "ize": 806,
      "ment": 807,
      "Î²": 808,
      "tex": 809,
      "Ġlet": 810,
      "Ġ19": 811,
      "ann": 812,
      "Ġterm": 813,
      "ĠÃĹ": 814,
      "Ġusing": 815,
      "Ġdec": 816,
      "Ïĥ": 817,
      "Ġprogram": 818,
      "ĠAl": 819,
      "Ġevery": 820,
      "ties": 821,
      "amet": 822,
      "ces": 823,
      "âĨĴ": 824,
      "ffic": 825,
      "Ġ9": 826,
      "Ġprov": 827,
      "Ġfinite": 828,
      "ĠProof": 829,
      "ight": 830,
      "ory": 831,
      "Ġproof": 832,
      "ĠAn": 833,
      "ĠâĪĨ": 834,
      "Ġorder": 835,
      "ension": 836,
      "ag": 837,
      "ld": 838,
      "ied": 839,
      "EE": 840,
      "Ġobtain": 841,
      "Ġdata": 842,
      "fore": 843,
      "put": 844,
      "ndom": 845,
      "aly": 846,
      "Ġdistribution": 847,
      "Ġund": 848,
      "Ġsame": 849,
      "Ġout": 850,
      "ective": 851,
      "Ġrec": 852,
      "Ġinde": 853,
      "Ġdet": 854,
      "resp": 855,
      "Ġrandom": 856,
      "Ġcontain": 857,
      "19": 858,
      "ization": 859,
      "ower": 860,
      "ased": 861,
      "Ġ200": 862,
      "Ġro": 863,
      "Ġcondition": 864,
      "Ġproper": 865,
      "abl": 866,
      "ove": 867,
      "ĠIt": 868,
      "ulti": 869,
      "Ġdifferen": 870,
      "een": 871,
      "Ġthan": 872,
      "now": 873,
      "ion": 874,
      "etween": 875,
      "ator": 876,
      "Ġoptim": 877,
      "ding": 878,
      "ample": 879,
      "au": 880,
      "Ġresp": 881,
      "out": 882,
      "Ġbetween": 883,
      "Ġfact": 884,
      "Ġā": 885,
      "tions": 886,
      "ient": 887,
      "Ġprobability": 888,
      "Ġinte": 889,
      "Ġsystem": 890,
      "Ġim": 891,
      "hod": 892,
      "Ġline": 893,
      "Ġ`": 894,
      "rix": 895,
      "ĠÎµ": 896,
      "group": 897,
      "Ġthese": 898,
      "oth": 899,
      "ĠBy": 900,
      "ke": 901,
      "odes": 902,
      "vel": 903,
      "ov": 904,
      "formation": 905,
      "ism": 906,
      "Ġclass": 907,
      "tical": 908,
      "Ġtype": 909,
      "ÏĦ": 910,
      "ould": 911,
      "Ġtr": 912,
      "orph": 913,
      "Ġreg": 914,
      "cre": 915,
      "ile": 916,
      "Ġ:=": 917,
      "atisf": 918,
      "âĪŀ": 919,
      "Ġconsider": 920,
      "ni": 921,
      "Ġmore": 922,
      "ĠSt": 923,
      "ĠâĪļ": 924,
      "ating": 925,
      "Ġext": 926,
      "Ġsatisf": 927,
      "Î³": 928,
      "Ġunder": 929,
      "Ç«": 930,
      "ail": 931,
      "Âµ": 932,
      "ints": 933,
      "Ġmatrix": 934,
      "ip": 935,
      "Ġsequ": 936,
      "Ġprocess": 937,
      "Î´": 938,
      "Ġsm": 939,
      "ĠSince": 940,
      "ide": 941,
      "ized": 942,
      "Ġsubs": 943,
      "respond": 944,
      "Ġparamet": 945,
      "Ġlar": 946,
      "ĠDe": 947,
      "Ġresults": 948,
      "Ġused": 949,
      "ark": 950,
      "ves": 951,
      "ĠÏĨ": 952,
      "position": 953,
      "ĠSection": 954,
      "13": 955,
      "Ġanaly": 956,
      "Ġmethod": 957,
      "Ġhol": 958,
      "Ġgeneral": 959,
      "Ġbut": 960,
      "ĠComp": 961,
      "Ġmost": 962,
      "ub": 963,
      "vers": 964,
      "Ġmulti": 965,
      "ĠThere": 966,
      "Ġcorrespond": 967,
      "15": 968,
      "Ġappl": 969,
      "ew": 970,
      "Ġdefined": 971,
      "Ġgroups": 972,
      "Ħ¦": 973,
      "Ġconstr": 974,
      "Ġcall": 975,
      "Ġ;": 976,
      "tics": 977,
      "ðĿĳ": 978,
      "16": 979,
      "Ġcomm": 980,
      "14": 981,
      "Ġint": 982,
      "ual": 983,
      "ever": 984,
      "Ġoper": 985,
      "Ġpr": 986,
      "Ġresult": 987,
      "Ġrequ": 988,
      "):": 989,
      "ists": 990,
      "Ġloc": 991,
      "Ġinto": 992,
      "osed": 993,
      "ĠĐ": 994,
      "Ġinst": 995,
      "Ġē": 996,
      "22": 997,
      "ĠĒ": 998,
      "ĠâĪ©": 999,
      "tern": 1000,
      "Ġpath": 1001,
      "Â·": 1002,
      "ech": 1003,
      "ĠÎ£": 1004,
      "Ġsince": 1005,
      "are": 1006,
      "ÏĢ": 1007,
      "Ġmay": 1008,
      "Ġwork": 1009,
      "Ġminim": 1010,
      "Ġrepresent": 1011,
      "omorph": 1012,
      "xt": 1013,
      "ures": 1014,
      "Ġ12": 1015,
      "Ġđ": 1016,
      "ĠâĪŀ": 1017,
      "imension": 1018,
      "ected": 1019,
      "Ġvalue": 1020,
      "Ġid": 1021,
      "Ġmaxim": 1022,
      "ĠâĢ¢": 1023,
      "ted": 1024,
      "Ġcol": 1025,
      "Ġspec": 1026,
      "Ġsec": 1027,
      "ilar": 1028,
      "tices": 1029,
      "Ġsubgroup": 1030,
      "Ġpl": 1031,
      "par": 1032,
      "Ġsize": 1033,
      "Ġer": 1034,
      "ĠâĪª": 1035,
      "Ġet": 1036,
      "ia": 1037,
      "Ġspace": 1038,
      "Ġvect": 1039,
      "Ġperform": 1040,
      "etwork": 1041,
      "Ġpoint": 1042,
      "ĠÎ·": 1043,
      "Ġstruct": 1044,
      "nt": 1045,
      "Ġrem": 1046,
      "ob": 1047,
      "its": 1048,
      "Ġvertex": 1049,
      "ables": 1050,
      "ĠTo": 1051,
      "Ġabove": 1052,
      "âī": 1053,
      "cy": 1054,
      "Ġexists": 1055,
      "eng": 1056,
      "Ġboth": 1057,
      "vari": 1058,
      "Ġsupp": 1059,
      "iel": 1060,
      "Ġsign": 1061,
      "17": 1062,
      "mb": 1063,
      "Ġneed": 1064,
      "ĠFigure": 1065,
      "ian": 1066,
      "Ïģ": 1067,
      "Ġsmall": 1068,
      "ases": 1069,
      "ock": 1070,
      "Ġbec": 1071,
      "Ġlinear": 1072,
      "Ġsolution": 1073,
      "201": 1074,
      "ause": 1075,
      "Ġknow": 1076,
      "ĠProposition": 1077,
      "ption": 1078,
      "ational": 1079,
      "ĠâĬĨ": 1080,
      "Îµ": 1081,
      "Ġimpl": 1082,
      "ression": 1083,
      "als": 1084,
      "Ġpartic": 1085,
      "Ġnorm": 1086,
      "Ġup": 1087,
      "Ġedge": 1088,
      "Ġdesc": 1089,
      "Ġapproxim": 1090,
      "Ġvertices": 1091,
      "Ġdifferent": 1092,
      "Îĵ": 1093,
      "fficient": 1094,
      "Ġprop": 1095,
      "ord": 1096,
      "low": 1097,
      "Ġmean": 1098,
      "ference": 1099,
      "ĠOn": 1100,
      "Ġmeas": 1101,
      "equ": 1102,
      "Ġdefinition": 1103,
      "Ġcomplex": 1104,
      "ĠThus": 1105,
      "ning": 1106,
      "Ġpos": 1107,
      "âĦĵ": 1108,
      "Ġlim": 1109,
      "Ġexample": 1110,
      "ings": 1111,
      "ten": 1112,
      "arch": 1113,
      "tial": 1114,
      "ĠNote": 1115,
      "aus": 1116,
      "Ġobser": 1117,
      "Ġman": 1118,
      "Ġpoly": 1119,
      "Ġpp": 1120,
      "ress": 1121,
      "duction": 1122,
      "ved": 1123,
      "Ġtak": 1124,
      "sible": 1125,
      "ii": 1126,
      "Ġinteg": 1127,
      "ij": 1128,
      "Ġdoes": 1129,
      "pendent": 1130,
      "over": 1131,
      "ule": 1132,
      "Ġdenote": 1133,
      "annel": 1134,
      "Ġsee": 1135,
      "Ġtheir": 1136,
      "art": 1137,
      "que": 1138,
      "Ġ))": 1139,
      "owever": 1140,
      "Ġnetwork": 1141,
      "Ġdefine": 1142,
      "con": 1143,
      "ens": 1144,
      "Ġdire": 1145,
      "olog": 1146,
      "Ġleast": 1147,
      "ject": 1148,
      "hed": 1149,
      "ĠâĦĵ": 1150,
      "ications": 1151,
      "Ġsem": 1152,
      "ival": 1153,
      "ĠÏķ": 1154,
      "20": 1155,
      "Ġbl": 1156,
      "Ġmax": 1157,
      "Ġwell": 1158,
      "Ġcode": 1159,
      "Ġpaper": 1160,
      "ice": 1161,
      "hen": 1162,
      "cur": 1163,
      "ĠSu": 1164,
      "Ġerr": 1165,
      "lements": 1166,
      "ell": 1167,
      "Ġpresent": 1168,
      "Ġparticular": 1169,
      "ced": 1170,
      "Ġnew": 1171,
      "ength": 1172,
      "Ġtree": 1173,
      "Ġassume": 1174,
      "Ġprove": 1175,
      "Ġfix": 1176,
      "ci": 1177,
      "Ġpair": 1178,
      "Ġstep": 1179,
      "geb": 1180,
      "ĠâĹıâĹı": 1181,
      "Ġ\\": 1182,
      "ood": 1183,
      "Ġedges": 1184,
      "Ġvariables": 1185,
      "Ġconstra": 1186,
      "Ġwas": 1187,
      "urn": 1188,
      "Ġcho": 1189,
      "Ġconstant": 1190,
      "Ġconn": 1191,
      "ĠDefin": 1192,
      "angu": 1193,
      "ĠSp": 1194,
      "ĠÏĪ": 1195,
      "Ġă": 1196,
      "Ġinformation": 1197,
      "Ìģ": 1198,
      "ive": 1199,
      "Ġholds": 1200,
      "ving": 1201,
      "Ġvalues": 1202,
      "Ġaut": 1203,
      "Ġran": 1204,
      "Ġelement": 1205,
      "sitive": 1206,
      "du": 1207,
      "ĠSy": 1208,
      "Ġsequence": 1209,
      "ĠComput": 1210,
      "18": 1211,
      "Ġsection": 1212,
      "Ġnode": 1213,
      "Ġlarge": 1214,
      "Ġmap": 1215,
      "Ġfunctions": 1216,
      "Ġanalysis": 1217,
      "Ġsecond": 1218,
      "omorphism": 1219,
      "Ġchannel": 1220,
      "gin": 1221,
      "mm": 1222,
      "duced": 1223,
      "oint": 1224,
      "ck": 1225,
      "urther": 1226,
      "log": 1227,
      "Ġend": 1228,
      "ĠâĪ¼": 1229,
      "ples": 1230,
      "Ġnow": 1231,
      "Ġelements": 1232,
      "ĠApp": 1233,
      "Ġď": 1234,
      "gn": 1235,
      "etric": 1236,
      "ĠCh": 1237,
      "ĠâĦ¦": 1238,
      "clu": 1239,
      "bit": 1240,
      "wise": 1241,
      "âĪĨ": 1242,
      "ĠEx": 1243,
      "Ġarg": 1244,
      "Ġtri": 1245,
      "Ġvol": 1246,
      "Ġri": 1247,
      "bin": 1248,
      "Ġimplies": 1249,
      "Ġbased": 1250,
      "asi": 1251,
      "Ġder": 1252,
      "Ġstate": 1253,
      "ĠRe": 1254,
      "pt": 1255,
      "Ġequival": 1256,
      "ness": 1257,
      "Ġwr": 1258,
      "ral": 1259,
      "Ġalgorithms": 1260,
      "Ġdi": 1261,
      "ĠâĨ": 1262,
      "Ġrun": 1263,
      "istic": 1264,
      "Ġcorresponding": 1265,
      "Ġbeen": 1266,
      "ĠÎ½": 1267,
      "Ġlength": 1268,
      "ming": 1269,
      "Ĺ¦": 1270,
      "ug": 1271,
      "ght": 1272,
      "Ġdepend": 1273,
      "ĠÎ¦": 1274,
      "Ġdeg": 1275,
      "dic": 1276,
      "200": 1277,
      "Ġ15": 1278,
      "ĠTherefore": 1279,
      ")|": 1280,
      "ets": 1281,
      "ĠHence": 1282,
      "Ġexpl": 1283,
      "ĠÇ«": 1284,
      "me": 1285,
      "uction": 1286,
      "Ġcompon": 1287,
      "ectively": 1288,
      "Ġli": 1289,
      "Ġstructure": 1290,
      "omial": 1291,
      "av": 1292,
      "Ġvector": 1293,
      "Ġoptimal": 1294,
      ",âĢĿ": 1295,
      "ency": 1296,
      "Ġag": 1297,
      "ern": 1298,
      "Ġ13": 1299,
      "EEE": 1300,
      "Ġï£´": 1301,
      "Ġinequ": 1302,
      "Ġgraphs": 1303,
      "ink": 1304,
      "Ġinput": 1305,
      "Ġsimilar": 1306,
      "Ġmain": 1307,
      "rent": 1308,
      "ĠMore": 1309,
      "Ġstud": 1310,
      "ull": 1311,
      "Ġ16": 1312,
      "Ġadd": 1313,
      "Ġ11": 1314,
      "Ġintro": 1315,
      "Ġent": 1316,
      "ft": 1317,
      "ĠIEEE": 1318,
      "Ġnodes": 1319,
      "Ġtheorem": 1320,
      "rough": 1321,
      "23": 1322,
      "Ġsing": 1323,
      "Ġconver": 1324,
      "Ġthey": 1325,
      "fer": 1326,
      "oci": 1327,
      "ĠÎ¾": 1328,
      "ry": 1329,
      "Ġsimple": 1330,
      "Ġexist": 1331,
      "Ġidenti": 1332,
      "Ġtest": 1333,
      "ific": 1334,
      "Ġapproach": 1335,
      "ero": 1336,
      "Ġdisc": 1337,
      "yn": 1338,
      "Ġdenot": 1339,
      "Ġindependent": 1340,
      "ĠÏī": 1341,
      "hes": 1342,
      "Ġchar": 1343,
      "ĠâĪĤ": 1344,
      "25": 1345,
      "ON": 1346,
      "Ġdescrib": 1347,
      "ER": 1348,
      "ĠAlgorithm": 1349,
      "ĠHowever": 1350,
      "Ġmeasure": 1351,
      "Ġproduc": 1352,
      "Ġmust": 1353,
      "Ġbecause": 1354,
      "gebra": 1355,
      "Ġerror": 1356,
      "ement": 1357,
      "sive": 1358,
      "Ġpoints": 1359,
      "Ġuni": 1360,
      "Ġret": 1361,
      "Ġ20": 1362,
      "Ġlat": 1363,
      "....": 1364,
      "Ġlo": 1365,
      "Ġsets": 1366,
      "acter": 1367,
      "Ġimplement": 1368,
      "Ġ14": 1369,
      "Ġincre": 1370,
      "Ġlangu": 1371,
      "ful": 1372,
      "lect": 1373,
      "Ġblock": 1374,
      "âī¤": 1375,
      "Î·": 1376,
      "Ġpossible": 1377,
      "ĠÎº": 1378,
      "vious": 1379,
      "21": 1380,
      "inu": 1381,
      "ermin": 1382,
      "Ġterms": 1383,
      "one": 1384,
      "ceed": 1385,
      "Ġfe": 1386,
      "ha": 1387,
      "Ġwhile": 1388,
      "Ġcontains": 1389,
      "Ġparameter": 1390,
      "24": 1391,
      "Ġdom": 1392,
      "ĠDefinition": 1393,
      "Ġam": 1394,
      "Ġvariable": 1395,
      "abel": 1396,
      "round": 1397,
      "Ġhigh": 1398,
      "ĠSupp": 1399,
      "side": 1400,
      "Ġrate": 1401,
      "Ġlower": 1402,
      "Ġbounded": 1403,
      "Ġrespectively": 1404,
      "Ġpower": 1405,
      "ulation": 1406,
      "ither": 1407,
      "Ġallow": 1408,
      "TI": 1409,
      "Ġcons": 1410,
      "ays": 1411,
      "lection": 1412,
      "see": 1413,
      "ĠCor": 1414,
      "ĠMat": 1415,
      "nomial": 1416,
      "get": 1417,
      "ential": 1418,
      "ough": 1419,
      "âĬ": 1420,
      "Ġget": 1421,
      "ear": 1422,
      "Ġunif": 1423,
      "Ġreal": 1424,
      "Ġdirect": 1425,
      "ame": 1426,
      "Ġnormal": 1427,
      "Ġaction": 1428,
      "ying": 1429,
      "ish": 1430,
      "Ġthus": 1431,
      "ators": 1432,
      "heck": 1433,
      "Ġ199": 1434,
      "line": 1435,
      "ural": 1436,
      "Ġcorre": 1437,
      "ired": 1438,
      "sing": 1439,
      "action": 1440,
      "cor": 1441,
      "Ġcharacter": 1442,
      "Ġobtained": 1443,
      "ĠPr": 1444,
      "ĠNow": 1445,
      ")(": 1446,
      "ects": 1447,
      "Ġproperty": 1448,
      "Ġâĩ": 1449,
      "Ġwould": 1450,
      "ities": 1451,
      "Ġstand": 1452,
      "Ġfixed": 1453,
      "Ġtra": 1454,
      "Ġass": 1455,
      "Ïī": 1456,
      "ollary": 1457,
      "ey": 1458,
      "not": 1459,
      "Ġtech": 1460,
      "ier": 1461,
      "ĠÎĽ": 1462,
      "Ġdimension": 1463,
      "anti": 1464,
      "Ġhand": 1465,
      "Ġcou": 1466,
      "ÏĨ": 1467,
      "tice": 1468,
      "fter": 1469,
      "Î½": 1470,
      "Ġcur": 1471,
      "read": 1472,
      "ax": 1473,
      "Ġser": 1474,
      "val": 1475,
      "ĠâĬĹ": 1476,
      "ules": 1477,
      "}.": 1478,
      "aces": 1479,
      "sian": 1480,
      "Ġapply": 1481,
      "Ġtop": 1482,
      "ĠâĹ¦": 1483,
      "Ġhy": 1484,
      "pper": 1485,
      "ĠFin": 1486,
      "},": 1487,
      "ĠâĪĢ": 1488,
      "ND": 1489,
      "olic": 1490,
      "Ġpositive": 1491,
      "Ġmany": 1492,
      "gy": 1493,
      "mit": 1494,
      "Ġconstruct": 1495,
      "Ġ!": 1496,
      "Ġpolynomial": 1497,
      "Ġsingle": 1498,
      "chie": 1499,
      "Ġproperties": 1500,
      "Ġsup": 1501,
      "ĠCom": 1502,
      "CM": 1503,
      "ments": 1504,
      "Ġprovid": 1505,
      "Ġshown": 1506,
      "Ġgenerated": 1507,
      "Ġdistance": 1508,
      "Ġeven": 1509,
      "ages": 1510,
      "ĠÎĺ": 1511,
      "ĠSuppose": 1512,
      "ĠAssum": 1513,
      "tal": 1514,
      "Ġinequality": 1515,
      "xi": 1516,
      "duce": 1517,
      "Ġcost": 1518,
      ")-": 1519,
      "Ġbin": 1520,
      "Ġcy": 1521,
      "âĹıâĹı": 1522,
      "Ġcalled": 1523,
      "Ġph": 1524,
      "Î¾": 1525,
      "Ġexact": 1526,
      "finite": 1527,
      "Ġwor": 1528,
      "Ġinstance": 1529,
      "ĠâĬĤ": 1530,
      "Ġperformance": 1531,
      "Ġpri": 1532,
      "Ġparti": 1533,
      "Ġachie": 1534,
      "Ġiter": 1535,
      "ĠHe": 1536,
      "ok": 1537,
      "min": 1538,
      "Ġlevel": 1539,
      "Ġlem": 1540,
      "hema": 1541,
      "Ġaddition": 1542,
      "Ġcases": 1543,
      "Ġbas": 1544,
      "ology": 1545,
      "26": 1546,
      "the": 1547,
      "ature": 1548,
      "Ġthrough": 1549,
      "Ġpages": 1550,
      "sp": 1551,
      "Ġmon": 1552,
      "Ġrank": 1553,
      "Ġmodels": 1554,
      "tiv": 1555,
      "ĠâĬ¢": 1556,
      "oding": 1557,
      "old": 1558,
      "Ġeither": 1559,
      "Ġindex": 1560,
      "Ġshows": 1561,
      "Ġcomplexity": 1562,
      "Ġdesign": 1563,
      "ĠOur": 1564,
      "Ġargum": 1565,
      "Î£": 1566,
      "Ġcontinu": 1567,
      "Ġproblems": 1568,
      "ĠâĪ§": 1569,
      "ching": 1570,
      "uted": 1571,
      "Ġstandard": 1572,
      "aussian": 1573,
      "Ġbounds": 1574,
      "aim": 1575,
      "ring": 1576,
      "Ġexec": 1577,
      "Ġsum": 1578,
      "Ġquer": 1579,
      "ymp": 1580,
      "Ġ100": 1581,
      "Ġuniform": 1582,
      "Ġgu": 1583,
      "Ġpart": 1584,
      "Ġright": 1585,
      "Ġori": 1586,
      "stric": 1587,
      "Ġsupport": 1588,
      "sequ": 1589,
      "ympto": 1590,
      "Ġderiv": 1591,
      "Ġcap": 1592,
      "Ġrespect": 1593,
      "nce": 1594,
      "sign": 1595,
      "Ġmem": 1596,
      "Ġtre": 1597,
      "verage": 1598,
      "Ġcent": 1599,
      "ĠË": 1600,
      "Ġeff": 1601,
      "Ġsche": 1602,
      "Ġconf": 1603,
      "row": 1604,
      "clud": 1605,
      "Ġassoci": 1606,
      "Ġ17": 1607,
      "30": 1608,
      "ĠâĢĵ": 1609,
      "valu": 1610,
      "Ġcommun": 1611,
      "Ġthree": 1612,
      "ĠMoreover": 1613,
      "Ġremain": 1614,
      "28": 1615,
      "vex": 1616,
      "ĠâĨĲ": 1617,
      "nal": 1618,
      "Ġcheck": 1619,
      "Ġhence": 1620,
      "ex": 1621,
      "Ġleft": 1622,
      "Ġknown": 1623,
      "Ġexpression": 1624,
      "27": 1625,
      "Ġcombin": 1626,
      "rary": 1627,
      "alc": 1628,
      "Ġreturn": 1629,
      "rest": 1630,
      ")/": 1631,
      "less": 1632,
      "Ġequivalent": 1633,
      "Ġdiscus": 1634,
      "Ġfind": 1635,
      "ven": 1636,
      "Ġsetting": 1637,
      "mod": 1638,
      "ĠCorollary": 1639,
      "Ġtrue": 1640,
      "Ġway": 1641,
      "Ġproposed": 1642,
      "Ġpred": 1643,
      "SI": 1644,
      "Ġdetermin": 1645,
      "ĠTrans": 1646,
      "ute": 1647,
      "crete": 1648,
      "Ġhow": 1649,
      "up": 1650,
      "Ġequal": 1651,
      "ĠÎł": 1652,
      "max": 1653,
      "Ġproced": 1654,
      "Ġconnected": 1655,
      "Ġlocal": 1656,
      "Ġprec": 1657,
      "Ġconditions": 1658,
      "ymptotic": 1659,
      "Ġmaximum": 1660,
      "Ġ18": 1661,
      "ÃĹ": 1662,
      "rop": 1663,
      "Ġupper": 1664,
      "Ġgo": 1665,
      "Ġextend": 1666,
      "Ġhyper": 1667,
      "ĠSim": 1668,
      "Ġsatisfies": 1669,
      "Ġclust": 1670,
      "Ġapproximation": 1671,
      "ĠSci": 1672,
      "Ġtotal": 1673,
      "ne": 1674,
      "Ġtheory": 1675,
      "ĠCl": 1676,
      "Ġdegree": 1677,
      "lear": 1678,
      "Ġparameters": 1679,
      "Ġrestric": 1680,
      "Ġthem": 1681,
      "Ġsample": 1682,
      "ST": 1683,
      "Ġsubset": 1684,
      "Ġtypes": 1685,
      "ually": 1686,
      "Ġevalu": 1687,
      "ger": 1688,
      "ource": 1689,
      "29": 1690,
      "Ġprevious": 1691,
      "Ġ#": 1692,
      "Ġoutput": 1693,
      "Ġsystems": 1694,
      "Ġlimit": 1695,
      "Ġsl": 1696,
      "Ġxi": 1697,
      "ĠUni": 1698,
      "Ġfree": 1699,
      "ib": 1700,
      "Ġnat": 1701,
      ");": 1702,
      "Ġrule": 1703,
      "Ġ&": 1704,
      "ynam": 1705,
      "Ġrece": 1706,
      "Ġoc": 1707,
      "Ġfactor": 1708,
      "for": 1709,
      "ĠðĿĳ": 1710,
      "Ġge": 1711,
      "Ġ..": 1712,
      "comp": 1713,
      "iven": 1714,
      "Ġrepl": 1715,
      "Ġweight": 1716,
      "AN": 1717,
      "ys": 1718,
      "iter": 1719,
      "Ġlabel": 1720,
      "ision": 1721,
      "Ġlanguage": 1722,
      "Ġarbit": 1723,
      "Ġlemma": 1724,
      "sity": 1725,
      "pro": 1726,
      "Ġbu": 1727,
      "ences": 1728,
      "¬ģ": 1729,
      "Ġstatis": 1730,
      "Ġinv": 1731,
      "ĠRec": 1732,
      "Ġsimpl": 1733,
      "Ġestimation": 1734,
      "ĠÄ": 1735,
      "clude": 1736,
      "ron": 1737,
      "gence": 1738,
      "Ġav": 1739,
      "AR": 1740,
      "Ġ25": 1741,
      "Ġwithout": 1742,
      "stract": 1743,
      "ĠÏĩ": 1744,
      "Ġini": 1745,
      "ically": 1746,
      "Ġroot": 1747,
      "oss": 1748,
      "rices": 1749,
      "Ġmethods": 1750,
      "ield": 1751,
      "ances": 1752,
      "Ġinterest": 1753,
      "tr": 1754,
      "ĠConsider": 1755,
      "05": 1756,
      "Ġformul": 1757,
      "Ġconsist": 1758,
      "ÏĪ": 1759,
      "ighb": 1760,
      "onal": 1761,
      "IN": 1762,
      "vial": 1763,
      "ss": 1764,
      "AL": 1765,
      "OR": 1766,
      "ately": 1767,
      "Ġpredic": 1768,
      "ared": 1769,
      "Ġdecomp": 1770,
      "Ġabout": 1771,
      "Ġwhose": 1772,
      "tit": 1773,
      "Ġalgebra": 1774,
      "oid": 1775,
      "li": 1776,
      "ner": 1777,
      "jective": 1778,
      "ĠUnivers": 1779,
      "Ġzero": 1780,
      "Ġproduct": 1781,
      "ants": 1782,
      "Ġnote": 1783,
      "ĠGaussian": 1784,
      "Ġnext": 1785,
      "ĠGiven": 1786,
      "Ġtechni": 1787,
      "imensional": 1788,
      "33": 1789,
      "atic": 1790,
      "Ġemp": 1791,
      "ï£": 1792,
      "Ġimpro": 1793,
      "rid": 1794,
      "Ġassign": 1795,
      "Ġestimator": 1796,
      "verse": 1797,
      "SE": 1798,
      "Ġcomplete": 1799,
      "Ġcontex": 1800,
      "ÌĪ": 1801,
      "ields": 1802,
      "ind": 1803,
      "ks": 1804,
      "Ġsur": 1805,
      "ult": 1806,
      "Ġgives": 1807,
      "Ġafter": 1808,
      "Ġlast": 1809,
      "ange": 1810,
      "sh": 1811,
      "Ġunique": 1812,
      "Ġvia": 1813,
      "time": 1814,
      "Ġbi": 1815,
      "Ġstrong": 1816,
      "ĠFurther": 1817,
      "ĠACM": 1818,
      "Ġpres": 1819,
      "ĠLe": 1820,
      "Ġversion": 1821,
      "Ġstat": 1822,
      "di": 1823,
      "acy": 1824,
      "ĠFinally": 1825,
      "Ġlist": 1826,
      "ward": 1827,
      "ified": 1828,
      "Ġmeans": 1829,
      "Ġsymb": 1830,
      "Ġsepar": 1831,
      "AM": 1832,
      "Ġassumption": 1833,
      "Ġobserv": 1834,
      "ĠTheory": 1835,
      "Ġfram": 1836,
      "tt": 1837,
      "lo": 1838,
      "Ïķ": 1839,
      "Ġidentif": 1840,
      "ĠâĪħ": 1841,
      "Ġ21": 1842,
      "ĠNe": 1843,
      "alcul": 1844,
      "Ġquanti": 1845,
      "Ġuser": 1846,
      "cording": 1847,
      "pr": 1848,
      "AT": 1849,
      "Ġtran": 1850,
      "Ġhyp": 1851,
      "mis": 1852,
      "Ġfam": 1853,
      "man": 1854,
      "dimensional": 1855,
      "ecess": 1856,
      "34": 1857,
      "Ġhom": 1858,
      "Ġide": 1859,
      "Ġwrite": 1860,
      "Ġel": 1861,
      "35": 1862,
      "Ġvery": 1863,
      "velop": 1864,
      "ĠInd": 1865,
      ")]": 1866,
      "Xiv": 1867,
      "Ġsay": 1868,
      "Îº": 1869,
      "hood": 1870,
      "icit": 1871,
      "alle": 1872,
      "âĦ¦": 1873,
      "graph": 1874,
      "ĠRem": 1875,
      "Ġasymptotic": 1876,
      "Ġrepresentation": 1877,
      "Ġmatrices": 1878,
      "Ġcompute": 1879,
      "Ġact": 1880,
      "asing": 1881,
      "Ġconstruction": 1882,
      "ginal": 1883,
      "les": 1884,
      "imes": 1885,
      "Ġinteger": 1886,
      "ene": 1887,
      "ĠWhen": 1888,
      "pre": 1889,
      "Ġcomputation": 1890,
      "Ġcannot": 1891,
      "med": 1892,
      "Ġupd": 1893,
      "aran": 1894,
      "ently": 1895,
      "Ġoccur": 1896,
      "Ġcontro": 1897,
      "eed": 1898,
      "pping": 1899,
      "emp": 1900,
      "other": 1901,
      "Ġseman": 1902,
      "variant": 1903,
      "ĠAd": 1904,
      "ole": 1905,
      "Ġâī¡": 1906,
      "pling": 1907,
      "Ġcompact": 1908,
      "Ġindic": 1909,
      "Ġscal": 1910,
      "LE": 1911,
      "Ġsymm": 1912,
      "Ġprogramming": 1913,
      "Ġneighb": 1914,
      "Ġconc": 1915,
      "Ġinf": 1916,
      "Ġ2016": 1917,
      "Ġprocedure": 1918,
      "ave": 1919,
      "ĠÂ´": 1920,
      "based": 1921,
      "Ġsufficient": 1922,
      "ĠSe": 1923,
      "ification": 1924,
      "ournal": 1925,
      "ĠFirst": 1926,
      "Ġconvex": 1927,
      "Ġperm": 1928,
      "ĠMathema": 1929,
      "Ã©": 1930,
      "ĠSo": 1931,
      "son": 1932,
      "Ġconstraints": 1933,
      "Ġclosed": 1934,
      "ason": 1935,
      "ĠUn": 1936,
      "Ġest": 1937,
      "ĠInt": 1938,
      "Ġpartition": 1939,
      "ering": 1940,
      "Ġrules": 1941,
      "cept": 1942,
      "ĠÎ¨": 1943,
      "36": 1944,
      "ols": 1945,
      "Ġdue": 1946,
      "hesis": 1947,
      "Ġenc": 1948,
      "Ġinitial": 1949,
      "Ġconstraint": 1950,
      "Ġassociated": 1951,
      "Ġcomponent": 1952,
      "ik": 1953,
      "ĠMath": 1954,
      "ceedings": 1955,
      "IC": 1956,
      "ines": 1957,
      "ynamic": 1958,
      "ĠUniversity": 1959,
      "Ġfurther": 1960,
      "ĠII": 1961,
      "Ġcontinuous": 1962,
      "Ġimport": 1963,
      "led": 1964,
      "Ġinfinite": 1965,
      "Ġpi": 1966,
      "attern": 1967,
      "32": 1968,
      "Ġshould": 1969,
      "Ġminimum": 1970,
      "04": 1971,
      "Ġtermin": 1972,
      "ĠJournal": 1973,
      "Ġgive": 1974,
      "Ġ24": 1975,
      "Ġsignal": 1976,
      "Ġprovide": 1977,
      "Ġvi": 1978,
      "ĠProceedings": 1979,
      "ernel": 1980,
      "cle": 1981,
      "ertain": 1982,
      "perim": 1983,
      "uch": 1984,
      "Ġthose": 1985,
      "allel": 1986,
      "Ġ)|": 1987,
      "Ġ2017": 1988,
      "Ġln": 1989,
      "Ġcontext": 1990,
      "ĠAND": 1991,
      "Ġprograms": 1992,
      "ily": 1993,
      "Ġima": 1994,
      "sidered": 1995,
      "Ġnetworks": 1996,
      "umn": 1997,
      "Ġbeing": 1998,
      "Ġhypot": 1999,
      "ype": 2000,
      "ters": 2001,
      "Ġapplications": 2002,
      "Ġval": 2003,
      "itive": 2004,
      "Ġexpon": 2005,
      "Ġarbitrary": 2006,
      "olution": 2007,
      "Ġ||": 2008,
      "37": 2009,
      "Ġbel": 2010,
      "Ġhere": 2011,
      "Ġmetric": 2012,
      "ible": 2013,
      "Ġrequire": 2014,
      "Ġlike": 2015,
      "arante": 2016,
      "ĠProgram": 2017,
      "Ġbelow": 2018,
      "Ġmess": 2019,
      "Ġconsidered": 2020,
      "Ġscheme": 2021,
      "Ġbo": 2022,
      "])": 2023,
      "Ġlear": 2024,
      "und": 2025,
      "Ġextension": 2026,
      "Ġchoice": 2027,
      "ques": 2028,
      "99": 2029,
      "Ġtherefore": 2030,
      "ĠFrom": 2031,
      "Ġwere": 2032,
      "Ġrelation": 2033,
      "Ġregular": 2034,
      "RO": 2035,
      "ĠÐ": 2036,
      "mbed": 2037,
      "ĠTable": 2038,
      "¿½": 2039,
      "Ġloss": 2040,
      "Ġstudy": 2041,
      "ĠSte": 2042,
      "ĠÎ¶": 2043,
      "Ġdetail": 2044,
      "02": 2045,
      "ility": 2046,
      "Ġmemory": 2047,
      "more": 2048,
      "Ġnecess": 2049,
      "EN": 2050,
      "most": 2051,
      "til": 2052,
      "Ġmultiple": 2053,
      "Ġsubgroups": 2054,
      "ĠAr": 2055,
      "ild": 2056,
      "ĠRemark": 2057,
      "Ġlead": 2058,
      "ĠUsing": 2059,
      "izes": 2060,
      "ead": 2061,
      "Ġnatural": 2062,
      "ify": 2063,
      "Ġdevelop": 2064,
      "]).": 2065,
      "Ġguarante": 2066,
      "ffici": 2067,
      "Ġspar": 2068,
      "Ġclaim": 2069,
      "Ġcorrect": 2070,
      "ĠNo": 2071,
      "Ġdensity": 2072,
      "Ġcell": 2073,
      "Ġdomain": 2074,
      "aw": 2075,
      "ĠSh": 2076,
      "Ġdistributions": 2077,
      "ĠRes": 2078,
      "Ġcomponents": 2079,
      "ĠOb": 2080,
      "Ġbeha": 2081,
      "ĠâĪĴâĨĴ": 2082,
      "amples": 2083,
      "Ġsearch": 2084,
      "Ġcontr": 2085,
      "lying": 2086,
      "Ġinclud": 2087,
      "ometric": 2088,
      "sk": 2089,
      "38": 2090,
      "45": 2091,
      "06": 2092,
      "ĠHere": 2093,
      "ĠarXiv": 2094,
      "uring": 2095,
      "ick": 2096,
      "Ġâĭ": 2097,
      "Ġargument": 2098,
      "ĠAut": 2099,
      "ane": 2100,
      "plit": 2101,
      "Ġmaximal": 2102,
      "Ġefficient": 2103,
      "Ġcodes": 2104,
      "ĠProb": 2105,
      "Ġdecomposition": 2106,
      "Ġstrate": 2107,
      "Ġreason": 2108,
      "Ġcolumn": 2109,
      "Ġdescribed": 2110,
      "Ġapplication": 2111,
      "Ġspecial": 2112,
      "Ġ2015": 2113,
      "Ġunit": 2114,
      "ĠAb": 2115,
      "Ġ)(": 2116,
      "PS": 2117,
      "ttp": 2118,
      "Ġconj": 2119,
      "Ġlow": 2120,
      "Ġtransform": 2121,
      "sif": 2122,
      "Ġdenotes": 2123,
      "31": 2124,
      "CS": 2125,
      "000": 2126,
      "Ġmake": 2127,
      "Ġ\"": 2128,
      "ĠComm": 2129,
      "Ġoptimization": 2130,
      "jection": 2131,
      "Ġrecur": 2132,
      "ES": 2133,
      "Ġcould": 2134,
      "//": 2135,
      "Ġtake": 2136,
      "aris": 2137,
      "Ġwhether": 2138,
      "Ġembed": 2139,
      "Ġaverage": 2140,
      "Ġopen": 2141,
      "ways": 2142,
      "Ġtimes": 2143,
      "Ġexactly": 2144,
      "ĠEn": 2145,
      "Ġkernel": 2146,
      "igen": 2147,
      "ringer": 2148,
      "Ġrow": 2149,
      "OM": 2150,
      "eli": 2151,
      "08": 2152,
      "Ġestimate": 2153,
      "fic": 2154,
      "ĠâĢĻ": 2155,
      "ework": 2156,
      "Ġmach": 2157,
      "ĠOp": 2158,
      "izing": 2159,
      "Ġcontra": 2160,
      "inc": 2161,
      "Ġwithin": 2162,
      "Ġkey": 2163,
      "Ġvectors": 2164,
      "ĠThese": 2165,
      "ĠĂ": 2166,
      "ai": 2167,
      "ÎĽ": 2168,
      "Ġagain": 2169,
      "Ġcr": 2170,
      "Ġbefore": 2171,
      "ĠSpringer": 2172,
      "Ġpaths": 2173,
      "TION": 2174,
      "ĠXi": 2175,
      "ries": 2176,
      "gative": 2177,
      "ĠComputer": 2178,
      "Ġstar": 2179,
      "Ġrelative": 2180,
      "Ġsuc": 2181,
      ")).": 2182,
      "Ġalways": 2183,
      "app": 2184,
      "Ġclasses": 2185,
      "Ġitem": 2186,
      "Xi": 2187,
      "://": 2188,
      "Ġshort": 2189,
      "IT": 2190,
      "Ġsemantics": 2191,
      "Ġ30": 2192,
      "Ġcalcul": 2193,
      "Ġappear": 2194,
      "iew": 2195,
      "idth": 2196,
      "ĠïĢ": 2197,
      "Ġstates": 2198,
      "Ġdiscuss": 2199,
      "ĠAnn": 2200,
      "Ġmatching": 2201,
      "Ġhold": 2202,
      "SA": 2203,
      "Ġfound": 2204,
      "ĠâĩĴ": 2205,
      "39": 2206,
      "Ġ2014": 2207,
      "Î¦": 2208,
      "here": 2209,
      "Ġposition": 2210,
      "Ġotherwise": 2211,
      "ĠLi": 2212,
      "IM": 2213,
      "Ġnotation": 2214,
      "ĠAssume": 2215,
      "ĠScience": 2216,
      ")âĪĴ": 2217,
      "resh": 2218,
      "Ġhttp": 2219,
      "Ġcontradic": 2220,
      "Ġloop": 2221,
      "Ġ~": 2222,
      "ptions": 2223,
      "Ġrequired": 2224,
      "Ġ22": 2225,
      "Ġcycl": 2226,
      "ĠWith": 2227,
      "Ġexecution": 2228,
      "ĠâĬķ": 2229,
      "medi": 2230,
      "Ġcommon": 2231,
      "Ġcurrent": 2232,
      "ount": 2233,
      "requ": 2234,
      "Ġcontrol": 2235,
      "Ġnoise": 2236,
      "Ġgre": 2237,
      "Ġside": 2238,
      "Ġdat": 2239,
      "till": 2240,
      "........": 2241,
      "ĉĊ": 2242,
      "Ġeigen": 2243,
      "Ġ?": 2244,
      "Ġspect": 2245,
      "mer": 2246,
      "Ġprior": 2247,
      "Ġhig": 2248,
      "07": 2249,
      "Ġpattern": 2250,
      "ray": 2251,
      "actions": 2252,
      "Ġprac": 2253,
      "com": 2254,
      "Ġweak": 2255,
      "Ġlink": 2256,
      "etry": 2257,
      "Ġdistributed": 2258,
      "own": 2259,
      "ĠExample": 2260,
      "Ġpresented": 2261,
      "PT": 2262,
      "Ġimportant": 2263,
      "know": 2264,
      "ĠIntern": 2265,
      "ĠStatis": 2266,
      "Ġread": 2267,
      "Ġbinary": 2268,
      "sc": 2269,
      "ailable": 2270,
      "ĠCo": 2271,
      "antum": 2272,
      "Ġdem": 2273,
      "lation": 2274,
      "Ġ((": 2275,
      "Ġselect": 2276,
      "Ġcovari": 2277,
      "Ġframework": 2278,
      "joint": 2279,
      "ense": 2280,
      "Ġdiv": 2281,
      "ï¿½": 2282,
      "Ġbehavi": 2283,
      "roxim": 2284,
      "09": 2285,
      "Ġconvergence": 2286,
      "Ġclear": 2287,
      "ires": 2288,
      "AC": 2289,
      "199": 2290,
      "Ġtransmit": 2291,
      "Ġsever": 2292,
      "ĠPh": 2293,
      "Ġfil": 2294,
      "ross": 2295,
      "Ġlong": 2296,
      "Ġpack": 2297,
      "Ġback": 2298,
      "Ġoperations": 2299,
      "Ġreduction": 2300,
      "Ġestabl": 2301,
      "Ġimplementation": 2302,
      "onstr": 2303,
      "Ġseveral": 2304,
      "Ġdenoted": 2305,
      "clusion": 2306,
      "endix": 2307,
      "Ġdynamic": 2308,
      "ĠSimilar": 2309,
      "ĠAc": 2310,
      "osen": 2311,
      "ĠFurthermore": 2312,
      "af": 2313,
      "Ġexperim": 2314,
      "Ġgl": 2315,
      "Ġname": 2316,
      "AS": 2317,
      "astic": 2318,
      "Ġaccording": 2319,
      "Ġuses": 2320,
      "Ġinterval": 2321,
      "Ġaccess": 2322,
      "ĠSch": 2323,
      "Ġview": 2324,
      "po": 2325,
      "Ġsource": 2326,
      "Ðµ": 2327,
      "Ġfamily": 2328,
      "ĠMod": 2329,
      "Ġcoun": 2330,
      "Ð¾": 2331,
      "Ġstore": 2332,
      "ĠSub": 2333,
      "Ġwords": 2334,
      "Ġsymmetric": 2335,
      "Ġmak": 2336,
      "ustr": 2337,
      "ze": 2338,
      "Ġatt": 2339,
      "Ġsynt": 2340,
      "Ġwrit": 2341,
      "Ġcommunication": 2342,
      "Ġcoe": 2343,
      "ĠâĮ": 2344,
      "oy": 2345,
      "Ġquery": 2346,
      "Ġcover": 2347,
      "Ġregion": 2348,
      "order": 2349,
      "Ġfull": 2350,
      "Ġ23": 2351,
      "Ġ27": 2352,
      "ior": 2353,
      "Ġmultipl": 2354,
      "Ġallows": 2355,
      "Ġ26": 2356,
      "--": 2357,
      "Ġcapac": 2358,
      "Ġinduction": 2359,
      "Ġtrees": 2360,
      "Ġoriginal": 2361,
      "Ġrefer": 2362,
      "Ġchange": 2363,
      "Ġfield": 2364,
      "Ġless": 2365,
      "ental": 2366,
      "ĠRecall": 2367,
      "Ġind": 2368,
      "stra": 2369,
      "Ġrelations": 2370,
      "ru": 2371,
      "ics": 2372,
      "vant": 2373,
      "Ġstill": 2374,
      "sib": 2375,
      "oring": 2376,
      "Ġparallel": 2377,
      "Ġapplied": 2378,
      "Ġpairs": 2379,
      "Ġtransition": 2380,
      "âĮ": 2381,
      "Ġsqu": 2382,
      "Ġpartial": 2383,
      "40": 2384,
      "known": 2385,
      "Ġ(âĪĴ": 2386,
      "ware": 2387,
      "Ġyields": 2388,
      "ĠPar": 2389,
      "sw": 2390,
      "Ġobject": 2391,
      "tivity": 2392,
      "Ġvalid": 2393,
      "Ġflow": 2394,
      "Ġpermut": 2395,
      "âĢ²âĢ²": 2396,
      "Ġevent": 2397,
      "Ġï£¬": 2398,
      "imin": 2399,
      "/(": 2400,
      "Ġ28": 2401,
      "Ġhypothesis": 2402,
      "jects": 2403,
      "asy": 2404,
      "Ġoperation": 2405,
      "entially": 2406,
      "ply": 2407,
      "Ġrelated": 2408,
      "Ġoperator": 2409,
      "Ġaltern": 2410,
      "Ġchain": 2411,
      "Ġexpected": 2412,
      "Ġsatisfying": 2413,
      "Ġinters": 2414,
      "ety": 2415,
      "Ġpost": 2416,
      "Ġill": 2417,
      "mission": 2418,
      "Ġref": 2419,
      "Ġprecise": 2420,
      "Ġinterpre": 2421,
      "Ġjust": 2422,
      "rad": 2423,
      "ĠOne": 2424,
      "Ġrequires": 2425,
      "ton": 2426,
      "ĠWh": 2427,
      "omorphic": 2428,
      "ï¬ģ": 2429,
      "Ġbelong": 2430,
      "Ġeasi": 2431,
      "inct": 2432,
      "assif": 2433,
      "Ġir": 2434,
      "Ġminimal": 2435,
      "Ġcre": 2436,
      "arily": 2437,
      "sel": 2438,
      "ĠRn": 2439,
      "Ġcertain": 2440,
      "air": 2441,
      "tri": 2442,
      "ĠAppl": 2443,
      "Ġgood": 2444,
      "Ġrati": 2445,
      "ordin": 2446,
      "Ġround": 2447,
      "ĠðĿ": 2448,
      "ĠCommun": 2449,
      "75": 2450,
      "Ġphase": 2451,
